Repository: Grandmaster0111/Agroforest-app
Catalog: lib/l10n/app_*.arb
Languages: hi, ne

# appTitle
source: Smart Irrigation
hi: स्मार्ट सिंचाई
ne: स्मार्ट सिंचाई

source: Home
hi: होम
ne: गृह

source: Analytics
hi: एनालिटिक्स
ne: विश्लेषण

source: Real-time Sensor Data
hi: रियल-टाइम सेंसर डेटा
ne: वास्तविक-समय सेन्सर डेटा

source: Soil Moisture
hi: मिट्टी की नमी
ne: माटोको चिस्यान

source: Temperature
hi: तापमान
ne: तापक्रम

source: Humidity
hi: नमी
ne: आर्द्रता

source: Water Tank Level
hi: पानी की टंकी का स्तर
ne: पानीको ट्याङ्कीको स्तर

source: Weather Forecast
hi: मौसम का पूर्वानुमान
ne: मौसम पूर्वानुमान

source: Irrigation Control
hi: सिंचाई नियंत्रण
ne: सिंचाई नियन्त्रण

source: Automatic Mode
hi: स्वचालित मोड
ne: स्वचालित मोड

source: Turn Valve ON
hi: वाल्व चालू करें
ne: भल्भ खोल्नुहोस्

source: Turn Valve OFF
hi: वाल्व बंद करें
ne: भल्भ बन्द गर्नुहोस्

source: Set Timer
hi: टाइमर सेट करें
ne: टाइमर सेट गर्नुहोस्

source: Moisture Trends
hi: नमी के रुझान
ne: चिस्यान प्रवृत्ति

source: Irrigation Cycles
hi: सिंचाई चक्र
ne: सिंचाई चक्र

source: Tank Level Trends
hi: टैंक स्तर के रुझान
ne: ट्याङ्की स्तर प्रवृत्ति

source: Crop
hi: फसल
ne: बाली

# selectCrop
source: Select a crop to see irrigation advice
hi: सिंचाई सलाह देखने के लिए फसल का चयन करें
ne: सिंचाई सल्लाह हेर्न बाली चयन गर्नुहोस्

# soilDry
source: Soil is dry for {cropName} – irrigation required
hi: {cropName} के लिए मिट्टी सूखी है - सिंचाई की आवश्यकता है
ne: {cropName} को लागि माटो सुख्खा छ - सिंचाई आवश्यक छ

# soilWet
source: Soil is wet for {cropName} – no irrigation needed
hi: {cropName} के लिए मिट्टी गीली है - सिंचाई की आवश्यकता नहीं है
ne: {cropName} को लागि माटो भिजेको छ - सिंचाई आवश्यक छैन

# soilOptimal
source: Soil moisture is optimal for {cropName}
hi: {cropName} के लिए मिट्टी की नमी इष्टतम है
ne: {cropName} को लागि माटोको चिस्यान इष्टतम छ

# waterTankLow
source: Water tank is low. Consider water-saving practices.
hi: पानी की टंकी कम है। पानी बचाने की प्रथाओं पर विचार करें।
ne: पानीको ट्याङ्की कम छ। पानी बचत गर्ने अभ्यासहरू विचार गर्नुहोस्।

# waterTankFull
source: Water tank is almost full.
hi: पानी की टंकी लगभग भर चुकी है।
ne: पानीको ट्याङ्की लगभग भरिएको छ।

# waterTankOptimal
source: Water tank level is optimal.
hi: पानी की टंकी का स्तर इष्टतम है।
ne: पानीको ट्याङ्कीको स्तर इष्टतम छ।
